// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому
// 3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.
let friends = ["Ivan","Slavik", "Grisha", "Lera", "Ira"];
if(friends.length >= 3){
    console.log('це великий масив, в якому 3 і більше елементи')
}else{
    console.log('це маленький масив, в якому менше 3-х елементів')
}




// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між
//     двома іншими.
let a = 117
let b = 112
let c = 144

if((a > b && a < c)||(a < b && a > c)){
    console.log(a);
} else if((b > a && b < c)||(b < a && b > c)){
    console.log(b);
} else {
    console.log(c);
}
// //або
// let myNumber;
// if((a > b && a < c)||(a < b && a > c)){
//     myNumber = a;
// } else if((b > a && b < c)||(b < a && b > c)){
//     myNumber = b;
// } else {
//     myNumber = c;
// }
// console.log('середнє : ' +myNumber);



// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }
let ac = 1;
let bc = 2;
let result= (ac + bc < 4) ? 'Мало':'Багато';
 console.log(result);


// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let number = 0;
let calculate = (number > 0 && number < 100) ?'Позитив' :
    (number < 0 && number > -100) ? 'Негатив' : (number === 0) ?'Нуль' : 'Вийшли за межі'
console.log(calculate);


// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта -
//     з коротким записом(тернаркою)
let test = null
if(test){
    console.log('Правильно');
} else {
    console.log('Не Правильно')
}
let testik = 66
let resultik = testik ? 'Правильно' : 'Неправильно'
console.log(resultik);

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
// let data = prompt('Яка «офіційна» назва JavaScript?');
// if(data === 'ECMAScript'){
//     console.log('Правильно!')
// } else{
//     console.log('Не равильно!')
// }

//     - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let flat = 88;
if(flat >=1 && flat <=20){
    console.log('Під\'їзд 1')
} else if(flat >=21 && flat <=48){
    console.log('Під\'їзд 2')
}else if(flat >=49 && flat <=90){
    console.log('Під\'їзд 3')
} else {
    console.log('Не з цього дому')
}



// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО,
// якщо змінна не рівна 10 - тоді НЕВІРНО
// const numbers = prompt('Write the number');
// let res = +numbers === 10 ? 'Вірно' : 'Невірно'
// console.log(res);


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
// let idem = prompt('write the temperature');
// let temp = (idem > 10 && idem <22) ? 'ми йдемо ВЧИТИСЯ':'сидимо вдома і вчимося ОНЛАЙН'
// console.log(temp);

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення -
//     що число не вірне ... .
let lotary = prompt('Number')
switch (lotary){
    case '1':
        console.log('Авто')
    break;
    case '2':
        console.log('Мото')
        break;
    case '3':
        console.log('Телефон')
        break;
    case '4':
        console.log('Плеєр')
        break;
    case '5':
        console.log('Навушники')
        break;
    default:
        console.log('Невдача друже')
}